"""
Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2k), 
не превосходящие числа N.
"""
print("Введите число N: ")
n = int(input())
m = 1
while m < n:
    if m < n:
        print(m)
        m = m*2